{
  "url": "https://www.linkedin.com/in/amoryhui/",
  "connections": 462,
  "fullname": "Amory Hui",
  "location": "Hong Kong",
  "current": "Freelance Writer, Editor and Translator",
  "summary": "",
  "skills": [
    "Copywriting",
    "Press Releases",
    "Translation",
    "Editing",
    "Public Relations",
    "Proofreading",
    "Social Media",
    "Media Relations",
    "Media Events",
    "Corporate Communications",
    "Newsletters",
    "Media Pitches",
    "Academic Writing",
    "Marketing Communications",
    "Messaging",
    "Research",
    "Film"
  ],
  "languages": [
    "Japanese - Limited working proficiency",
    "English - Full professional proficiency",
    "Mandarin - Full professional proficiency",
    "Cantonese - Native or bilingual proficiency"
  ],
  "experience": {
    "current": [
      {
        "title": "Freelance Writer, Editor and Translator",
        "org": "Self-EmployedMidnight Blue",
        "date": "February 2016  –  Present (1 year 5 months)August 2016  –  Present (11 months)",
        "location": "",
        "desc": "- Offer copywriting, editing and translation services to companies and organizations across various sectors and industries, e.g. insurance, technology, film and entertainment, tertiary education, etc."
      }
    ],
    "past": [
      {
        "title": "Senior Account Executive",
        "org": "The Hoffman Agency",
        "date": "April 2015  –  January 2016 (10 months)",
        "location": "Hong Kong",
        "desc": "- Developed PR plans and provided strategic counsel for clients in the insurance and technology sectors<br>- Devised content strategy for various social media platforms, e.g. Facebook, Twitter and LinkedIn<br>- Crafted angles and storylines for media pitching (e.g. to secure interview opportunities)<br>- Oversaw media monitoring, elevated insights from the news, and proactively alerted client to potential crises<br>- Prepared bilingual press releases, bylined articles, and briefing documents for executives<br>- Assisted in new client pitches<br>- Assisted in regional marketing of the agency<br>- Polished PR reports"
      },
      {
        "title": "Assistant Marketing and PR Manager",
        "org": "Hong Kong International Film Festival Society Ltd.",
        "date": "May 2012  –  April 2013 (1 year)",
        "location": "",
        "desc": "- Devised cost-effective publicity plans for film-related events, including Hong Kong International Film Festival 2013, Paris Cinema International Film Festival  2012 (Special Program &quot;Hong Kong in Focus), Summer International Film Festival 2012, and Cine Italiano 2012<br>- Supervised junior staff to ensure smooth operations of the Marketing and PR team on a day-to-day basis<br>- Established relations with local and regional consumer and trade publications<br>- Crafted angles for media pitching to secure interview and editorial opportunities<br>- Developed press releases, eDMs, speeches and MC scripts<br>- Liaised with service vendors to produce marketing collaterals such as flyers, posters, print ads and promotion videos<br>- Secured barter deals and other joint promotion opportunities with media, retail stores and shopping malls<br>- Managed updates on the official website as well as  fan pages across different social media<br>- Monitored press coverage and compiled news clipping reports<br>- Liaised with artist managers, production houses, film companies and contracted PR films to oversee the rundown, staff deployment and media arrangement of high-profile events such as opening ceremonies, press conferences, premieres and parties"
      },
      {
        "title": "",
        "org": "Hong Kong International Film Festival Society Ltd.",
        "date": "October 2011  –  April 2012 (7 months)",
        "location": "",
        "desc": "- Coordinated the logistics of seminars, exhibitions, business meetings, networking luncheons, award ceremonies and other events<br>- Drafted company letters to government officials and industry professionals<br>- Liaised with editors, design companies and printing houses to produce bilingual publications<br>- Developed and maintained a database of filmmakers and financiers<br>- Set up an online application system for filmmakers to submit their projects"
      },
      {
        "title": "Copywriter",
        "org": "AM Communications",
        "date": "May 2011  –  October 2011 (6 months)",
        "location": "",
        "desc": "- Developed slogans, tag lines, brochures, press releases and other advertising copies for clients across a wide range of industries, from theme parks and fashion brands to investment banks and property developers"
      },
      {
        "title": "Editorial Coordinator",
        "org": "Hong Kong International Film Festival Society Ltd.",
        "date": "December 2010  –  April 2011 (5 months)",
        "location": "",
        "desc": "- Wrote up near 20 bilingual features for the festival&#x2019;s newsletters<br>- Liaised with freelance translators, design houses, and printing service providers<br>- Liaised with tertiary institutions to organize screenings and Q&amp;A sessions for selected student films<br>"
      },
      {
        "title": "Intern",
        "org": "Edko Films Ltd.",
        "date": "September 2009  –  January 2010 (5 months)",
        "location": "",
        "desc": "- Translated screenplays and subtitles<br>- Drafted and edited company letters<br>- Wrote up blurbs and production notes for local and foreign films"
      },
      {
        "title": "Intern",
        "org": "Hong Kong International Film Festival Society Ltd. (HKIFFS)",
        "date": "June 2009  –  August 2009 (3 months)",
        "location": "",
        "desc": "- Developed a database for over 1000 films screened in previous editions of the festival<br>- Translated Chinese press coverage into English highlights for the Marketing Team<br>- Initiated contact with directors and distributors of animation films in North America, Europe and Southeast Asia"
      }
    ]
  },
  "education": [
    {
      "school": "",
      "cert": "Master of Philosophy (MPhil), SociologyMaster of Philosophy (MPhil), Sociology",
      "date": "2013  –  2015"
    },
    {
      "school": "The University of Hong Kong",
      "cert": "Bachelor of Arts (B.A.), Comparative Literature, First Class Honors (Cumulative GPA: 3.87)Bachelor of Arts (B.A.), Comparative Literature, First Class Honors (Cumulative GPA: 3.87)",
      "date": "2007  –  2010"
    }
  ],
  "links": []
}