{
  "url": "https://www.linkedin.com/in/gege-gigi-wu-369b0660/",
  "connections": 500,
  "fullname": "Gege (Gigi) Wu",
  "location": "Beijing City, China",
  "current": "Luxury Operation Director Beijing RTMAP",
  "summary": "",
  "skills": [
    "Chinese",
    "Cantonese",
    "English",
    "Volleyball",
    "Piano",
    "Merchandising",
    "Microsoft Word",
    "Microsoft Excel",
    "Sales",
    "Microsoft Office",
    "Business Strategy",
    "Retail",
    "Fashion",
    "Luxury Goods",
    "Luxury Lifestyle",
    "See 8+",
    "Leadership",
    "Styling",
    "Apparel",
    "PowerPoint",
    "Public Relations",
    "Marketing Communications",
    "Training",
    "Management",
    "See less"
  ],
  "languages": [
    "English - Full professional proficiency",
    "Chinese - Native or bilingual proficiency",
    "Cantonese - Native or bilingual proficiency",
    "Italian - Elementary proficiency"
  ],
  "experience": {
    "current": [
      {
        "title": "General Manager",
        "org": "Sparkle Roll Jet co.,LtdAnimals Asia Foundation",
        "date": "October 2016  –  Present (9 months)August 2008  –  Present (8 years 11 months)",
        "location": "Beijing City, China",
        "desc": "Animals Asia is an Asian-focused registered charity with headquarters in Hong Kong and offices in Australia, China, Germany, Italy, the UK and USA, as well as Moon Bear Rescue Centres in China and Vietnam. We have around 270 staff worldwide. "
      }
    ],
    "past": [
      {
        "title": "",
        "org": "Beijing RTMAP Science and Technology Co., Ltd.Global Gifts Indy",
        "date": "July 2015  –  July 2016 (1 year 1 month)May 2010  –  May 2012 (2 years 1 month)",
        "location": "",
        "desc": "Shoppers appreciate that items are a product of centuries of talent and techniques passed down from generation to generation.  Products are hand-made by artisans spanning the globe and representing over 35 countries, mostly from the developing regions of the world.  But just as important as their exciting inventory, is that each purchase helps provide valuable employment for struggling artisans and producers in the developing world.  Global Gifts is a fair trade store.  "
      },
      {
        "title": "",
        "org": "Fendi",
        "date": "January 2014  –  June 2015 (1 year 6 months)",
        "location": "",
        "desc": "&#x2022; Support Merchandising Manager in following up Fendi&apos;s WRTW/Furs/WShoes business and maximizing sales and profit by providing the right product portfolio for the categories / lines<br>&#x2022; Provide analysis for SKU management, historical, and forecast sales, gross profit, and inventory<br>&#x2022; Maintain, report, and forecast merchandise sales, margin, receipts, and onorders for OpenToBuy<br>&#x2022; Support Merchandising Manager in defining and coordinating the strategies / objectives in terms of new product launch, new product development, distribution strategy, sales animation, product offer<br>&#x2022; Co-operate with supply chain and logistics team on on-time product delivery<br>&#x2022; Build up team spirit and relationship with retail management and associated to maximize business potential<br>&#x2022; In store training for all China stores"
      },
      {
        "title": "Retail Intern",
        "org": "Christian Dior Couture",
        "date": "July 2012  –  November 2012 (5 months)",
        "location": "Greater New York City Area",
        "desc": "&#x2022;\tRotated in Christian Dior 57th street Boutique, Dior Homme 57th street store, and Dior Homme SoHo store<br>&#x2022;\tReceived inventory from Pairs ensure that shipping, receive and inventory are process accurately <br>&#x2022;\tProvided outstanding customer services by greening and welcoming customers, answering the phone and addressing customer inquiries <br>&#x2022;\tPartnered with sales team in order to communicated with Chinese clients<br>&#x2022;\tParticipated in inventory and over night cycle count <br>&#x2022;\tAssisted sales associate with styling"
      },
      {
        "title": "Summer Intern",
        "org": "MyTeno",
        "date": "June 2011  –  August 2011 (3 months)",
        "location": "Shenzhen, Guangdong, China",
        "desc": "&#x2022;\tPersonalized apparel for haute couture customers, and provided exceptional customer service<br>&#x2022;\tCommunicated with haute couture customers regarding fit of tailored clothes and followed up and maximize sales opportunities<br>&#x2022;\tAssisted Design Team for &#x201C;La Danum&#x2019;s Night&#x201D; event fashion show"
      },
      {
        "title": "",
        "org": "Shin Kong Place Beijing",
        "date": "July 2010  –  August 2010 (2 months)",
        "location": "Beijing City, China",
        "desc": "&#x2022;\tCommunicated directly with Mr. Lelio Gavazza &#x2013; China Country Managing Director at Bvlgari on New B.zero1 series jewelry release <br>&#x2022;\tTranslated English to Chinese to over 100 medias and guests on Bvlgari new B.zero1 series release date<br>&#x2022;\tManaged the clock placement display for Blancpain new release event, &#x201C;Heritage Classic, the future leaders taking charge&#x201D;<br>&#x2022;\tProvided information and tour for the media and guests on Blancpain &#x201C;Heritage Classic, the future leaders taking charge&#x201D; clock display<br>&#x2022;\tBuilt relationship with China Merchants Bank&#x2019;s VIP customers to encourage shopping at Shin Kong Place"
      },
      {
        "title": "",
        "org": "",
        "date": "",
        "location": "",
        "desc": null
      }
    ]
  },
  "education": [
    {
      "school": "",
      "cert": "Master, Luxury and life style  ManagementMaster, Luxury and life style  Management",
      "date": "2013  –  2013"
    },
    {
      "school": "Indiana University Bloomington",
      "cert": "Bachelor of Science (B.S.), Apparel and TextilesBachelor of Science (B.S.), Apparel and Textiles",
      "date": "2008  –  2012"
    },
    {
      "school": "",
      "cert": "",
      "date": "2005  –  2008"
    }
  ],
  "links": []
}