{
  "url": "https://www.linkedin.com/in/ronsavino/",
  "connections": 500,
  "fullname": "Ron Savino",
  "location": "Hong Kong",
  "current": "Fintech Angel Investment and Advisory / Financial Services Executive Specialized in Strategy and Business Development",
  "summary": "A Financial Services Executive, turned Fintech Angel Investor and Advisor, with over 25 years of experience working in the Global Financial Services Industry, the last 15 being in Asia.  A member of the Fintech Asia 100 as one of the \"people shaping finance across the Asian region in 2016 and beyond\".   https://nextmoney.org/fintechasia100/During my career, I have held Senior Management, COO and Business Development roles working for various Global Financial Institutions including Bank of America Merrill Lynch, Goldman Sachs and ING. After many years of delivering growth and change to large Global Financial Institutions, I am focused on leveraging my experience and network to assist Fintech Start Ups in Asia. My strong track record of building, developing and managing Asian businesses is ideal for firms in the growth and development phases of their business in Asia.To help advance Fintech in Asia, I have founded and lead Asia Fintech Angels (\"AFTA\"), the first Asian Angel Investor Network dedicated to and specialized in Fintech and Financial Innovation. It is a curated group of 50+ Senior Financial Services Professionals, Entrepreneurs, Technologists and Venture Capitalists that have a passion for Fintech and want to provide funding, introductions and practical hands on mentoring to early stage Fintech businesses in Asia or those outside Asia looking to bring their business to the region.",
  "skills": [
    "Derivatives",
    "Finance",
    "Electronic Trading",
    "Equity Derivatives",
    "Equities",
    "Fixed Income",
    "Trading Systems",
    "Trading",
    "Hedge Funds",
    "Prime Brokerage",
    "Asset Management",
    "Business Strategy",
    "High Frequency Trading",
    "Strategic Planning",
    "New Business Development",
    "See 8+",
    "Business Process Improvement",
    "Project Management",
    "Futures",
    "Clearing",
    "Start-ups",
    "Angel Investing",
    "Financial Services",
    "Business Development",
    "See less"
  ],
  "experience": {
    "current": [
      {
        "title": "Founder",
        "org": "Asia Fintech Angels",
        "date": "May 2015  –  Present (2 years 3 months)",
        "location": "Hong Kong",
        "desc": "- Founder of Asia Fintech Angels (&#x201C;AFTA&#x201D;), the first Asian Angel Investor Network dedicated to and specialized in Fintech and Financial Innovation.  <br><br>- AFTA members consist of Asian Based Senior Financial Services Professionals, Entrepreneurs, Technologists and Venture Capitalists.<br><br>- AFTA&apos;s network of Asian Fintech Investors have a proven track record of providing funding, introductions and practical hands on mentoring to early stage Fintech businesses.<br><br>Our members invest not only their money, but their time to help turn great ideas into great companies.  We believe that the true value add of an Angel Investor comes after the check is written.  By leveraging our vast personal networks, broad knowledge and specific expertise we will partner with our portfolio companies to help them accelerate their growth and build a sustainable and successful business. <br><br>AFTA&apos;s Mission is to:<br>1) Identify innovative, market changing, early stage Fintech Entrepreneurs in Asia or those outside Asia looking to expand their business into the region<br>&#xF0D8; <br>2) Establish a consortium of curated Angel Investors with unparalleled experience, knowledge and network in Asian Financial Services <br><br>3) Connect early to seed stage Fintech businesses with experienced Fintech Angel Investors and co-operate on syndicated deals with Angel Group partners and VC Firms.<br><br>4) Facilitate the growth and development of our portfolio companies by making introductions to our network and assisting in business development, team building, strategic planning and future fundraising.<br><br>5) Play a leading role in the development of the Asia Fintech ecosystem by organizing and participating in Fintech Industry events, seminars, and education and partnering with other members of the Asia Fintech community<br><br>6) Enhance cross border co-operation and links with the Global Fintech community by establishing partnerships and working relationships with key Fintech players across Asia, US and Europe."
      }
    ],
    "past": [
      {
        "title": "",
        "org": "Newedge",
        "date": "August 2011  –  October 2014 (3 years 3 months)",
        "location": "Hong Kong",
        "desc": "- Work with Asia CEO to manage all Newedge Asian activities - 450 staff across 7 countries, offering brokerage, clearing and prime brokerage for listed derivatives futures and options, cleared OTC, equities and FX<br><br>- Responsible for traditional COO activities (eg strategy and business development) as well as traditional CAO activities (eg support function management)   <br><br>- Development and implementation of Newedge Business Strategy across Asia<br><br>- Product development and project management of Newedge Strategic initiatives<br><br>- Business management functions, including budgeting, management reporting and financial analysis<br><br>- Direct management of Asian Regional Back Office functions: 250 staff across Operations, IT, E-solutions, Risk, Finance, HR, Treasury and Project/Process Management<br><br>- Managing Director of Hong Kong office, which is NE&#x2019;s Asian regional hub and booking center.<br><br>- Responsible Officer with the Hong Kong SFC and Alternative Chief Executive with the HKMA."
      },
      {
        "title": "",
        "org": "Bank Of America Merrill Lynch",
        "date": "August 2009  –  July 2011 (2 years)",
        "location": "Hong Kong",
        "desc": "- Functional Management and P&amp;L responsibility for the regional listed derivatives business in Asia<br><br>- Managed a team of 14 dedicated Futures Front Office personnel covering marketing, sales trading, product development and relationship management<br><br>- Responsible for the development and implementation of Business Strategy across all aspects of the business including marketing, sales trading and clearing (both listed and OTC)<br><br>- Business covered all derivatives asset classes (equities, fixed income and commodities) across all listed futures, options and OTC clearing exchanges/clearinghouses in Asia<br><br>- Development and management of a broad global client base across Hedge Funds, Real Money Accounts, CTAs and Professional Trading (PT) clients<br><br>- Designed a new Marketing Strategy leading to an increase in Client Volumes by 33% and client commission revenue by 10% from 2009 to 2010 and an increase of 40% in revenues from Q1 2010 to Q1 2011<br><br>- Developed specialized market leading platforms for Professional Trading / High Frequency trading clients<br><br>- Reviewed Futures Electronic Trading strategy including client trading systems, client connectivity, market gateways, futures algos, client on-boarding and trading support model."
      },
      {
        "title": "",
        "org": "Bank of America Merrill Lynch",
        "date": "February 2006  –  August 2009 (3 years 7 months)",
        "location": "Hong Kong",
        "desc": "- Regional COO Role covering Asian GMF&amp;F business lines, including: Prime Brokerage, Stock Loan, Delta One, and Listed Futures &amp; Options<br><br>- Creation and implementation of regional business strategies<br><br>- Product development and project management of all GMF&amp;F initiatives, ensuring all strategic projects were properly prioritized, resourced and delivered<br><br>- Developed and implemented strategy for Professional Trading / High Frequency Clients.  Led working group across PB, Electronic Trading and F&amp;O with responsibility for developing platform and marketing efforts that cater to the specific needs of this client base.    <br><br>- Front to back review of Asian Futures &amp; Options business and created regional business strategy<br><br>- Reviewed Australian Third Party Clearing business, identifying control improvements, operational efficiencies and strategic business direction<br><br>- Main point of contact in GMF&amp;F business for all support functions<br><br>- Ownership of all business management functions and management reporting including budgeting, financial analysis and client metrics"
      },
      {
        "title": "",
        "org": "Goldman Sachs",
        "date": "August 2005  –  February 2006 (7 months)",
        "location": "Hong Kong",
        "desc": "Responsible for analysis and planning for strategic Asia business development initiatives"
      },
      {
        "title": "",
        "org": "ING",
        "date": "August 2003  –  July 2005 (2 years)",
        "location": "",
        "desc": "- Functional responsibility for Settlements, IT and Administration departments (35 staff)<br>- Responsible for ensuring business lines received operational support necessary to achieve business objectives in a timely, cost effective and controlled manner.  Businesses included Equities, Fixed Income, FX, Corporate Banking, Investment Banking and Private Banking"
      },
      {
        "title": "",
        "org": "ING",
        "date": "July 2000  –  August 2003 (3 years 2 months)",
        "location": "Hong Kong",
        "desc": "- Supported Asia Regional COO Role in managing Ops/IT support for all business lines of ING Wholesale Banking (Equity, Fixed Income and Corporate Banking) across all 12 countries in Asia<br>- Role included direct management responsibility for some departments (40 staff) as well as working with COO to define and implement regional strategy and key development initiatives."
      },
      {
        "title": "VP, Internal Audit",
        "org": "ING Barings",
        "date": "February 1997  –  July 2000 (3 years 6 months)",
        "location": "Greater New York City Area",
        "desc": "Performed Front Office to Back Office risk and internal controls focused audits for various Corporate and Investment banking activities within the organization"
      }
    ]
  },
  "education": [
    {
      "school": "University of Pennsylvania - The Wharton School",
      "cert": "BS Economics, Finance and AccountingBS Economics, Finance and Accounting",
      "date": "1987  –  1991"
    }
  ],
  "links": []
}